mrkopz/tamaclaude/firmware/sdkconfig.defaults
# ESP32-D0WD-V3, 4MB flash, ไม่มี PSRAM
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BLE เท่านั้น — NimBLE เล็กกว่า Bluedroid และเราต้องการแค่ peripheral
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ONLY_LEGACY_ADV=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# snapshot ต้องเข้าได้ในการเขียนครั้งเดียว — daemon ตัดข้อความให้พอดี 500 ไบต์แล้ว
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y

# LVGL v9
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_LOG=n
CONFIG_LV_USE_OBSERVER=n
CONFIG_LV_USE_ANIMIMG=n
CONFIG_LV_USE_CHART=n
CONFIG_LV_USE_CALENDAR=n
CONFIG_LV_USE_KEYBOARD=n
# ปิด textarea ไม่ได้ — spinbox ใน LVGL 9.2 พึ่งมันแบบ #error ไม่ใช่แค่คอมไพล์ไม่ผ่าน
CONFIG_LV_USE_TABLE=n
CONFIG_LV_USE_SPAN=n

# งานวาดจอกินเวลานาน ให้ main task มี stack พอ
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
